"""
Задание 3.

Определить, какие из слов «attribute», «класс», «функция», «type»
     (без encode decode).

Подсказки:
--- используйте списки и циклы, не дублируйте функции
--- обязательно!!! усложните задачу, "отловив" исключение,
придумайте как это сделать
"""
words = ["attribute", "класс", "функция", "type"]
for i in words:
    word = bytes(i, 'utf-8')
    if str(word)[2]=="\\":
        print("Слово '{0}'  невозможно записать в байтовом виде с пом-ю макировки b".format(i))
