"""
Задание 2.

Каждое из слов «class», «function», «method» записать в байтовом формате
без преобразования в последовательность кодов
не используя!!! методы encode и decode)
и определить тип, содержимое и длину соответствующих переменных.

Подсказки:
--- b'class' - используйте маркировку b''
--- используйте списки и циклы, не дублируйте функции
"""
words = ["class", "function", "method"]
for i in words:
    word = bytes(i, 'utf-8')
    print(word, len(bytes(i, 'utf-8')), "содержимое и длинна")
    print(type(word), "тип переменной")
